public class Main {
    public static void main(String[] args) {
        // task 1, куда мыслить дальше, застрял. Циклы дались тяжело!!!
        // почему в первой строке все норм, а во второй какая-то дичь, почему счёт идёт с 11???
        // по ходу разобрался методом тыка, но мне кажется сложновато уже, учитывайте, что много новичков, делайте уроки
        // подробнее, расписывайте вкладку шпаргалка, инфы мало!!!
        int i = 1;

        while (i <= 10) {
            System.out.print(i + " ");
            i++;
        }

        System.out.println();

        for (i = 10; i > 0; i--) {
            System.out.print(i + " ");
        }

        // task 2 Подсмотрел решение преподавателя. Не понятен принцип. Слишком заумно. Я это не проходил. Незачёт.


        // task 3
        // Вообще не понял условия, с чего начинать. Математика страдает(((

    }
}